app/controllers/contracts_controller.rb

  def index
    @contracts = Contract.all
---
SELECT * FROM "contracts"

  def new
    @contract = @player.contracts.new
    @teams = Team.all
---
SELECT * FROM "teams"

  def create
    @contract = @player.contracts.new(params[:contract])
    @player.team_id  = @contract.team_id

      if @contract.save
---
INSERT INTO "contracts" ("start_date", "created_at", "updated_at", "player_id", "team_id", "end_date") VALUES('2011-01-04', '2011-01-04 16:44:16', '2011-01-04 16:44:16', 1, NULL, '2011-01-04')

  def find_player
    @player = Player.find(params[:player_id])
---
SELECT * FROM "players" WHERE ("players"."id" = 3)