app/controllers/league_tables_controller.rb

  def index
    @league_tables = LeagueTable.all
---
SELECT * FROM "league_tables"