app/controllers/leagues_controller.rb

SELECT * FROM "leagues"
---
  def index
    @leagues = League.all

SELECT * FROM "leagues" WHERE ("leagues"."id" = 1)
---
  def show
    @league = League.find(params[:id])

SELECT * FROM "leagues" WHERE ("leagues"."id" = 2)
---
  def edit
    @league = League.find(params[:id])

INSERT INTO "leagues" ("name", "created_at", "country", "updated_at") VALUES('Ekstraklasa', '2010-12-29 23:11:31', 'Polska', '2010-12-29 23:11:31')
---
  def create
    @league = League.new(params[:league])

    if @league.save

SELECT * FROM "leagues" WHERE ("leagues"."id" = 1)
---
  def update
    @league = League.find(params[:id])

SELECT * FROM "leagues" WHERE ("leagues"."id" = 4)
DELETE FROM "leagues" WHERE "id" = 4
---
  def destroy
    @league = League.find(params[:id])
    @league.destroy