app/controllers/matchdays_controller.rb

  def index
    @matchdays = Matchday.all
---
SELECT * FROM "matchdays"

  def show
    @matchday = Matchday.find(params[:id])
---
SELECT * FROM "matchdays" WHERE ("matchdays"."id" = 1)

  def edit
    @matchday = Matchday.find(params[:id])
---
SELECT * FROM "matchdays" WHERE ("matchdays"."id" = 1)

  def create
    @matchday = Matchday.new(params[:matchday])

      if @matchday.save
---
INSERT INTO "matchdays" ("created_at", "updated_at", "play_time", "season_id", "matchday_no") VALUES('2011-01-05 06:52:49', '2011-01-05 06:52:49', '2006-01-05', 1, 1)

  def find_seasons
    @seasons = Season.all
---
SELECT * FROM "seasons"