app/controllers/matches_controller.rb

SELECT * FROM "matches"
---
  def index
    @matches = Match.all

SELECT * FROM "matches" WHERE ("matches"."id" = 1)
---
  def show
    @match = Match.find(params[:id])

SELECT * FROM "matches" WHERE ("matches"."id" = 4)
---
  def edit
    @match = Match.find(params[:id])

INSERT INTO "matches" ("score_team_2", "created_at", "matchday_id", "updated_at", "team_1", "team_2", "score_team_1") VALUES(13123, '2011-01-05 21:42:40', 1, '2011-01-05 21:42:40', 19, 20, 213)
---
  def create
    @match = Match.new(params[:match])

      if @match.save

SELECT * FROM "matches" WHERE ("matches"."id" = 4)
UPDATE "matches" SET "updated_at" = '2011-01-05 23:02:25', "team_1" = 19, "score_team_2" = 27, "score_team_1" = 21 WHERE "id" = 4
---
  def update
    @match = Match.find(params[:id])

      if @match.update_attributes(params[:match])

SELECT * FROM "matches" WHERE ("matches"."id" = 1)
DELETE FROM "matches" WHERE "id" = 1
---
  def destroy
    @match = Match.find(params[:id])
    @match.destroy

SELECT * FROM "teams"
---
  def find_teams
    @teams = Team.all

SELECT * FROM "matchdays"
---
  def find_matchdays
    @matchdays = Matchday.all