app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT * FROM "players"

  def show
    @player = Player.find(params[:id])
    @player.find_active_contract
---
SELECT * FROM "players" WHERE ("players"."id" = 1)
SELECT * FROM "contracts" WHERE ("contracts".player_id = 1)

  def edit
    @player = Player.find(params[:id])
---
SELECT * FROM "players" WHERE ("players"."id" = 1)

  def create
    @player = Player.new(params[:player])

      if @player.save
---
INSERT INTO "players" ("position", "created_at", "country", "shirt_no", "updated_at", "birth_date", "firstname", "surname", "team_id") VALUES('rozgrywający', '2011-01-04 17:17:58', 'Polska', 16, '2011-01-04 17:17:58', '1986-02-06', 'Piotr', 'Fajka', 19)

  def destroy
    @player = Player.find(params[:id])
    @player.destroy
---
SELECT * FROM "players" WHERE ("players"."id" = 1)
DELETE FROM "players" WHERE "id" = 1

  def find_teams
    @teams = Team.all
---
SELECT * FROM "teams" WHERE (id = 19)