app/controllers/teams_controller.rb

SELECT * FROM "teams" ORDER BY teams.id DESC LIMIT 1
---
  def index
    @teams = Team.all

SELECT * FROM "teams" WHERE ("teams"."id" = 10 AND ("teams".league_id = 2))
---
  def show
    @team = Team.find(params[:id])

SELECT * FROM "leagues"
---
  def new
    @team = Team.new
    @leagues = League.all

SELECT * FROM "teams" WHERE ("teams"."id" = 1 AND ("teams".league_id = 3))
---
  def edit
    @team = Team.find(params[:id])

INSERT INTO "teams" ("name", "league_id", "created_at", "image_url", "updated_at", "coach") VALUES('eadf', NULL, '2010-12-31 02:41:34', 'adf', '2010-12-31 02:41:34', 'fadsf')
---
  def create
    @team = Team.new(params[:team])

      if @team.save

SELECT * FROM "teams" WHERE ("teams"."id" = 9)
UPDATE "teams" SET "updated_at" = '2011-01-03 17:28:19', "image_url" = '/images/vivetargilogo.png' WHERE "id" = 19
---
  def update
    @team = Team.find(params[:id])

      if @team.update_attributes(params[:team])

SELECT * FROM "teams" WHERE ("teams"."id" = 13)
DELETE FROM "teams" WHERE "id" = 13
---
  def destroy
    @team = Team.find(params[:id])
    @team.destroy

SELECT * FROM "leagues"
---
  def find_league
    @league = League.all